[Killed] BlockStatement
src/lib/validators.ts:15:55
  * - Boundary: Should mutate `>` to `>=` and vice-versa.
  *   A test with `age = 18` will kill the `>=` mutant but not the `>` mutant.
  */
-export const isOfLegalAge = (age: number): boolean => {
-  return age > 18;
-};
+export const isOfLegalAge = (age: number): boolean => {};
 
 /**
killedBy: Validation Logic isOfLegalAge should return true for ages greater than 18
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/validators.ts:16:10
  *   A test with `age = 18` will kill the `>=` mutant but not the `>` mutant.
  */
 export const isOfLegalAge = (age: number): boolean => {
-  return age > 18;
+  return false;
 };
 
killedBy: Validation Logic isOfLegalAge should return true for ages greater than 18
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/validators.ts:16:10
  *   A test with `age = 18` will kill the `>=` mutant but not the `>` mutant.
  */
 export const isOfLegalAge = (age: number): boolean => {
-  return age > 18;
+  return age <= 18;
 };
 
killedBy: Validation Logic isOfLegalAge should return true for ages greater than 18
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:30:90
  *   but the logic requires `&&`. Only testing `(true, true)` and `(false, false)`
  *   would not kill the mutant.
  */
-export const isEligibleForDiscount = (isMember: boolean, hasCoupon: boolean): boolean => {
-  return isMember && hasCoupon;
-};
+export const isEligibleForDiscount = (isMember: boolean, hasCoupon: boolean): boolean => {};
 
 /**
killedBy: Validation Logic isEligibleForDiscount should return true if user is a member and has a coupon
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/lib/validators.ts:31:10
  *   would not kill the mutant.
  */
 export const isEligibleForDiscount = (isMember: boolean, hasCoupon: boolean): boolean => {
-  return isMember && hasCoupon;
+  return isMember || hasCoupon;
 };
 
killedBy: Validation Logic isEligibleForDiscount should return false if user is not a member
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/validators.ts:31:10
  *   would not kill the mutant.
  */
 export const isEligibleForDiscount = (isMember: boolean, hasCoupon: boolean): boolean => {
-  return isMember && hasCoupon;
+  return true;
 };
 
killedBy: Validation Logic isEligibleForDiscount should return false if user is not a member
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:43:57
  * - String Literal: Should mutate the regex to be more or less strict.
  *   A simple test with a valid email might not catch all edge cases.
  */
-export const isValidEmail = (email: string): boolean => {
-  if (email === '') {
-    return false;
-  }
-  // A simple regex that is easily mutated
-  const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-  return emailRegex.test(email);
-};
+export const isValidEmail = (email: string): boolean => {};
 
 /**
killedBy: Validation Logic isValidEmail should return true for a valid email
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/validators.ts:44:7
  *   A simple test with a valid email might not catch all edge cases.
  */
 export const isValidEmail = (email: string): boolean => {
-  if (email === '') {
+  if (true) {
     return false;
   }
killedBy: Validation Logic isValidEmail should return true for a valid email
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/validators.ts:44:7
  *   A simple test with a valid email might not catch all edge cases.
  */
 export const isValidEmail = (email: string): boolean => {
-  if (email === '') {
+  if (email !== '') {
     return false;
   }
killedBy: Validation Logic isValidEmail should return true for a valid email
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/validators.ts:45:12
  */
 export const isValidEmail = (email: string): boolean => {
   if (email === '') {
-    return false;
+    return true;
   }
   // A simple regex that is easily mutated
killedBy: Validation Logic isValidEmail should return false for an empty string
statusReason: expected true to be false // Object.is equality

[Killed] Regex
src/lib/validators.ts:48:22
     return false;
   }
   // A simple regex that is easily mutated
-  const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const emailRegex = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
   return emailRegex.test(email);
 };
killedBy: Validation Logic isValidEmail should return true for a valid email
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/lib/validators.ts:48:22
     return false;
   }
   // A simple regex that is easily mutated
-  const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const emailRegex = /^[^\s@]+@[\s@]+\.[^\s@]+$/;
   return emailRegex.test(email);
 };
killedBy: Validation Logic isValidEmail should return true for a valid email
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:60:68
  * - Boundary: Mutates `>` and `<` operators.
  * - String Literal: Mutates the return strings "Strong", "Medium", "Weak".
  */
-export const checkPasswordStrength = (password: string): string => {
-  const len = password.length;
-  if (len > 12) {
-    return 'Strong';
-  } else if (len > 8) {
-    return 'Medium';
-  } else {
-    return 'Weak';
-  }
-};
+export const checkPasswordStrength = (password: string): string => {};
 
 /**
killedBy: Validation Logic checkPasswordStrength should return "Strong" for passwords longer than 12 chars
statusReason: expected undefined to be 'Strong' // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:62:17
  */
 export const checkPasswordStrength = (password: string): string => {
   const len = password.length;
-  if (len > 12) {
-    return 'Strong';
-  } else if (len > 8) {
+  if (len > 12) {} else if (len > 8) {
     return 'Medium';
   } else {
killedBy: Validation Logic checkPasswordStrength should return "Strong" for passwords longer than 12 chars
statusReason: expected undefined to be 'Strong' // Object.is equality

[Killed] ConditionalExpression
src/lib/validators.ts:62:7
  */
 export const checkPasswordStrength = (password: string): string => {
   const len = password.length;
-  if (len > 12) {
+  if (false) {
     return 'Strong';
   } else if (len > 8) {
killedBy: Validation Logic checkPasswordStrength should return "Strong" for passwords longer than 12 chars
statusReason: expected 'Medium' to be 'Strong' // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:64:23
   const len = password.length;
   if (len > 12) {
     return 'Strong';
-  } else if (len > 8) {
-    return 'Medium';
-  } else {
+  } else if (len > 8) {} else {
     return 'Weak';
   }
killedBy: Validation Logic checkPasswordStrength should return "Medium" for passwords between 9 and 12 chars
statusReason: expected undefined to be 'Medium' // Object.is equality

[Killed] EqualityOperator
src/lib/validators.ts:64:14
   const len = password.length;
   if (len > 12) {
     return 'Strong';
-  } else if (len > 8) {
+  } else if (len <= 8) {
     return 'Medium';
   } else {
killedBy: Validation Logic checkPasswordStrength should return "Medium" for passwords between 9 and 12 chars
statusReason: expected 'Weak' to be 'Medium' // Object.is equality

[Killed] StringLiteral
src/lib/validators.ts:65:12
   if (len > 12) {
     return 'Strong';
   } else if (len > 8) {
-    return 'Medium';
+    return "";
   } else {
     return 'Weak';
killedBy: Validation Logic checkPasswordStrength should return "Medium" for passwords between 9 and 12 chars
statusReason: expected '' to be 'Medium' // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:66:10
     return 'Strong';
   } else if (len > 8) {
     return 'Medium';
-  } else {
-    return 'Weak';
-  }
+  } else {}
 };
 
killedBy: Validation Logic checkPasswordStrength should return "Weak" for passwords 8 chars or less
statusReason: expected undefined to be 'Weak' // Object.is equality

[Killed] BlockStatement
src/lib/validators.ts:81:85
  * - Boundary: Mutates `>=` to `>` and `<=` to `<`.
  *   Tests should check prices equal to `min` and `max`.
  */
-export const isPriceInRange = (price: number, min: number, max: number): boolean => {
-  return price >= min && price <= max;
-};
+export const isPriceInRange = (price: number, min: number, max: number): boolean => {};
 
killedBy: Validation Logic isPriceInRange should return true when price is within the range
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/lib/validators.ts:82:26
  *   Tests should check prices equal to `min` and `max`.
  */
 export const isPriceInRange = (price: number, min: number, max: number): boolean => {
-  return price >= min && price <= max;
+  return price >= min && price > max;
 };
 
killedBy: Validation Logic isPriceInRange should return true when price is within the range
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/validators.ts:82:10
  *   Tests should check prices equal to `min` and `max`.
  */
 export const isPriceInRange = (price: number, min: number, max: number): boolean => {
-  return price >= min && price <= max;
+  return true;
 };
 
killedBy: Validation Logic isPriceInRange should return false when price is below the range
statusReason: expected true to be false // Object.is equality
